class SchoolInternalName {
    static wudang_internal_1 = 'wudang1'
    static wudang_internal_2 = 'wudang2'
    static wudang_internal_3 = 'wudang3'
    static wudang_internal_4 = 'wudang4'
    static wudang_internal_5 = 'wudang5'
    static wudang_internal_6 = 'wudang6'
    static wudang_internal_7 = 'wudang7'
}

class School {
    constructor(name) {
        this.name = name
        this.internals = []
    }
}

class Wudang extends School {
    constructor() {
        super(`wudang`)
        this.internals = [
            {
                name: `วิชาสองสัญฐานคุ้มใจ`,
                stats: {
                    brawn: 54,
                    dexterity: 15,
                    breath: 54,
                    spirit: 15,
                    stamina: 37
                },
                effect: `เมื่อถูกโจมตีมีโอกาศ 10 % ที่จะกระตุ้นพลังปราณแท้ดูดซับความเสียหาย 250 จุด 
                <br>เมื่อพลังปราณแท้สลายเพราะการโจมตีหรือหมดเวลา พลังส่วนหนึ่งจะถูกนำไปฟื้นฟูกำลังภายใน 
                <br>และอีกส่วนหนึ่งจะส่งผลกระทบกับรอบ ๆ ทำให้ศัตรูรอบ ๆ ขาชา ไม่สามารถเดินได้`
            }, 
            {
                name: `วิชายาพลังกลั่น`,
                stats: {
                    brawn: 54,
                    dexterity: 15,
                    breath: 54,
                    spirit: 15,
                    stamina: 37
                },
                effect: `การโจมตีมีโอกาศ 20% ฟื้นฟูกำลังภายใน 2% และการโจมตีแต่ละครั้งจะสร้างความเสียหายเพิ่มอีก 4% ของกำลังภายในที่เหลืออยู่`
            }, 
            {
                name: `วิชาโล่งไร้สิ้นสุด`,
                stats: {
                    brawn: 54,
                    dexterity: 15,
                    breath: 54,
                    spirit: 15,
                    stamina: 37
                },
                effect: `กายทองข้ามมหันตภัย: 
                <br>เมื่อพลังชีวิตต่ำกว่า 30% และถูกโจมตี จะฟื้นฟูพลังชีวิต 30% จากพลังชีวิตสูงสุดภายใน 5 วินาที เวลาคูลดาวน์ 100 วินาที
                <br>โล่งไร้สิ้นสุด: ความสูงของกระโดดย่ำเมฆา +3`
            }, 
            {
                name: `พลังเอี้ยงบ้อเก๊ก`,
                stats: {
                    brawn: 54,
                    dexterity: 15,
                    breath: 54,
                    spirit: 15,
                    stamina: 37
                },
                effect: ` เมื่อโจมตีมีโอกาสทำให้ศัตรูถูกแรงสะเทือนทำร้าย: ถูกโจมตีแต่ละครั้งจะได้รับความเสียหายหยางเพิ่มเติมติดต่อกัน 16 วินาที
                <br>เอี้ยงบ้อเก๊ก: ระหว่างที่เป้าหมายกำลังถูกแรงสะเทือนทำร้าย หลังจากออกกระบวนท่า 3 ครั้งและออกกระบวนท่ารุกอีกครั้งจะทำให้เกิด "บาดเจ็บภายในกำเริบ": 
                <br>ผนึกกระบวนท่าและวิชาตัวเบา 3 วินาที ถ้าไม่ถูก "บาดเจ็บภายในกำเริบ" จนแรงสะเทือนทำร้ายจบลงจะส่งผล "บาดเจ็บภายในกำเริบ"`
            }, 
            {
                name: `พลังอิงฟ้าคร่ามังกร`,
                stats: {
                    brawn: 54,
                    dexterity: 15,
                    breath: 54,
                    spirit: 15,
                    stamina: 37
                },
                effect: `ประกาศิตใต้หล้า: 
                <br>เมื่อโจมตีมีโอกาศเพิ่มพลังทำลายกระบวนท่าทั้งหมด 30% ละเลยปัดป้องเพิ่ม 25% เป็นเวลา 15 วินาที
                <br>ใครจะมาแข่ง: เมื่อถูกโจมตีมีโอกาศป้องกันพลังทำลายเพิ่ม 30% และฟื้นฟูเลือดลมต่อเนื่อง เป็นเวลา 15 วินาที
                <br>หนึ่งในยุทธภพ: ในช่วงระยะเวลาหนึ่งประกาศิตใต้หล้า และ ใครจะมาแข่งสามารถเกิดผลได้พร้อมกัน`
            }, 
            {
                name: `เทพวิชาไท้เก็ก`,
                stats: {
                    brawn: 54,
                    dexterity: 15,
                    breath: 54,
                    spirit: 15,
                    stamina: 37
                },
                effect: `กลายปราณ: 
                <br>เมื่อถูกโจมตีมีโอกาศดูดซับพลังทำลาย 30% และฟื้นฟูเลือดลมจำนวนหนึ่ง
                <br>พลังล่อ: เมื่อถูกโจมตีมีโอกาศดูดซับพลังทำลาย 30% และสะท้อนกลับใส่เป้าหมายเป็นพลังทำลายอ่อนเท่ากับพลังที่ดูดซับ
                <br>ไท่เก๊กคือเต๋า: เมื่อกลายปราณ และ พลังล่อถูกกระตุ้น จะมีโอกาศได้รับบัพเพิ่มพลังทำลายทั้งหมดของตนขึ้น 10% ซ้อนทับได้ 5 ครั้งต่อเนื่อง 10 วินาที เมื่อโจมตีบัพที่ซ้อนทับทั้งหมดจะถูกลบ`
            }
        ]
    }
}

const wudang = new Wudang()